SpacehuhnTech/arduino/wifiduck/avr/boards.txt
leonardo.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
leonardo.menu.keyboardid.logitechhid.build.vid=0x046d
leonardo.menu.keyboardid.logitechhid.build.pid=0xc316

leonardo.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
leonardo.menu.keyboardid.logitechgaming.build.vid=0x046d
leonardo.menu.keyboardid.logitechgaming.build.pid=0xc335

leonardo.menu.keyboardid.ms=Microsoft Keyboard
leonardo.menu.keyboardid.ms.build.vid=0x045e
leonardo.menu.keyboardid.ms.build.pid=0xfff8

########## Protocol ##########
leonardo.menu.protocol.auto=Auto (I2C & Serial)
leonardo.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

leonardo.menu.protocol.i2c=I2C
leonardo.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

leonardo.menu.protocol.serial=Serial
leonardo.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
leonardo.menu.debug.serial=Serial (115200b, newline)
leonardo.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

leonardo.menu.debug.disabled=Disabled

########## LED ##########
leonardo.menu.led.disabled=Disabled

leonardo.menu.led.neopixel=Neopixel (WS2812b)
leonardo.menu.led.neopixel.build.led_flags=-DENABLE_LED -DNEOPIXEL -DNEOPIXEL_NUM=1

leonardo.menu.ledpin.0=0 (RX Serial)
leonardo.menu.ledpin.0.build.led_pin=-DLED_PIN=0
leonardo.menu.ledpin.1=1 (TX Serial)
leonardo.menu.ledpin.1.build.led_pin=-DLED_PIN=1
leonardo.menu.ledpin.2=2 (SDA I2C)
leonardo.menu.ledpin.2.build.led_pin=-DLED_PIN=2
leonardo.menu.ledpin.3=~3 (SCL I2C)
leonardo.menu.ledpin.3.build.led_pin=-DLED_PIN=3
leonardo.menu.ledpin.4=4
leonardo.menu.ledpin.4.build.led_pin=-DLED_PIN=4
leonardo.menu.ledpin.5=~5
leonardo.menu.ledpin.5.build.led_pin=-DLED_PIN=5
leonardo.menu.ledpin.6=~6
leonardo.menu.ledpin.6.build.led_pin=-DLED_PIN=6
leonardo.menu.ledpin.7=7
leonardo.menu.ledpin.7.build.led_pin=-DLED_PIN=7
leonardo.menu.ledpin.8=8
leonardo.menu.ledpin.8.build.led_pin=-DLED_PIN=8
leonardo.menu.ledpin.9=~9
leonardo.menu.ledpin.9.build.led_pin=-DLED_PIN=9
leonardo.menu.ledpin.10=~10
leonardo.menu.ledpin.10.build.led_pin=-DLED_PIN=10
leonardo.menu.ledpin.11=~11
leonardo.menu.ledpin.11.build.led_pin=-DLED_PIN=11
leonardo.menu.ledpin.12=~12
leonardo.menu.ledpin.12.build.led_pin=-DLED_PIN=12
leonardo.menu.ledpin.13=~13
leonardo.menu.ledpin.13.build.led_pin=-DLED_PIN=13
leonardo.menu.ledpin.14=ICSP MISO (SPI)
leonardo.menu.ledpin.14.build.led_pin=-DLED_PIN=14
leonardo.menu.ledpin.15=ICSP SCLK (SPI)
leonardo.menu.ledpin.15.build.led_pin=-DLED_PIN=15
leonardo.menu.ledpin.16=ICSP MOSI (SPI)
leonardo.menu.ledpin.16.build.led_pin=-DLED_PIN=16
leonardo.menu.ledpin.18=A0
leonardo.menu.ledpin.18.build.led_pin=-DLED_PIN=18
leonardo.menu.ledpin.19=A1
leonardo.menu.ledpin.19.build.led_pin=-DLED_PIN=19
leonardo.menu.ledpin.20=A2
leonardo.menu.ledpin.20.build.led_pin=-DLED_PIN=20
leonardo.menu.ledpin.21=A3
leonardo.menu.ledpin.21.build.led_pin=-DLED_PIN=21
leonardo.menu.ledpin.22=A4
leonardo.menu.ledpin.22.build.led_pin=-DLED_PIN=22
leonardo.menu.ledpin.23=A5
leonardo.menu.ledpin.23.build.led_pin=-DLED_PIN=23

########## Serial Bridge ##########
leonardo.menu.bridge.disabled=Disabled

leonardo.menu.bridge.serial1=Serial1
leonardo.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

leonardo.menu.bridgebutton.2=2 (SDA I2C)
leonardo.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
leonardo.menu.bridgebutton.3=~3 (SCL I2C)
leonardo.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
leonardo.menu.bridgebutton.4=4
leonardo.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
leonardo.menu.bridgebutton.5=~5
leonardo.menu.bridgebutton.5.build.bridge_button=-DBRIDGE_SWITCH=5
leonardo.menu.bridgebutton.6=~6
leonardo.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
leonardo.menu.bridgebutton.7=7
leonardo.menu.bridgebutton.7.build.bridge_button=-DBRIDGE_SWITCH=7
leonardo.menu.bridgebutton.8=8
leonardo.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
leonardo.menu.bridgebutton.9=~9
leonardo.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
leonardo.menu.bridgebutton.10=~10
leonardo.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
leonardo.menu.bridgebutton.11=~11
leonardo.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
leonardo.menu.bridgebutton.12=~12
leonardo.menu.bridgebutton.12.build.bridge_button=-DBRIDGE_SWITCH=12
leonardo.menu.bridgebutton.13=~13
leonardo.menu.bridgebutton.13.build.bridge_button=-DBRIDGE_SWITCH=13
leonardo.menu.bridgebutton.14=ICSP MISO (SPI)
leonardo.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
leonardo.menu.bridgebutton.15=ICSP SCLK (SPI)
leonardo.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
leonardo.menu.bridgebutton.16=ICSP MOSI (SPI)
leonardo.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
leonardo.menu.bridgebutton.18=A0
leonardo.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
leonardo.menu.bridgebutton.19=A1
leonardo.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
leonardo.menu.bridgebutton.20=A2
leonardo.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20
leonardo.menu.bridgebutton.21=A3
leonardo.menu.bridgebutton.21.build.bridge_button=-DBRIDGE_SWITCH=21
leonardo.menu.bridgebutton.22=A4
leonardo.menu.bridgebutton.22.build.bridge_button=-DBRIDGE_SWITCH=22
leonardo.menu.bridgebutton.23=A5
leonardo.menu.bridgebutton.23.build.bridge_button=-DBRIDGE_SWITCH=23

leonardo.menu.bridgerst.2=2 (SDA I2C)
leonardo.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
leonardo.menu.bridgerst.3=~3 (SCL I2C)
leonardo.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
leonardo.menu.bridgerst.4=4
leonardo.menu.bridgerst.4.build.bridge_rst=-DBRIDGE_RST=4
leonardo.menu.bridgerst.5=~5
leonardo.menu.bridgerst.5.build.bridge_rst=-DBRIDGE_RST=5
leonardo.menu.bridgerst.6=~6
leonardo.menu.bridgerst.6.build.bridge_rst=-DBRIDGE_RST=6
leonardo.menu.bridgerst.7=7
leonardo.menu.bridgerst.7.build.bridge_rst=-DBRIDGE_RST=7
leonardo.menu.bridgerst.8=8
leonardo.menu.bridgerst.8.build.bridge_rst=-DBRIDGE_RST=8
leonardo.menu.bridgerst.9=~9
leonardo.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
leonardo.menu.bridgerst.10=~10
leonardo.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
leonardo.menu.bridgerst.11=~11
leonardo.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
leonardo.menu.bridgerst.12=~12
leonardo.menu.bridgerst.12.build.bridge_rst=-DBRIDGE_RST=12
leonardo.menu.bridgerst.13=~13
leonardo.menu.bridgerst.13.build.bridge_rst=-DBRIDGE_RST=13
leonardo.menu.bridgerst.14=ICSP MISO (SPI)
leonardo.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
leonardo.menu.bridgerst.15=ICSP SCLK (SPI)
leonardo.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
leonardo.menu.bridgerst.16=ICSP MOSI (SPI)
leonardo.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
leonardo.menu.bridgerst.18=A0
leonardo.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
leonardo.menu.bridgerst.19=A1
leonardo.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
leonardo.menu.bridgerst.20=A2
leonardo.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20
leonardo.menu.bridgerst.21=A3
leonardo.menu.bridgerst.21.build.bridge_rst=-DBRIDGE_RST=21
leonardo.menu.bridgerst.22=A4
leonardo.menu.bridgerst.222.build.bridge_rst=-DBRIDGE_RST=22
leonardo.menu.bridgerst.23=A5
leonardo.menu.bridgerst.23.build.bridge_rst=-DBRIDGE_RST=23

