SpacehuhnTech/arduino/wifiduck/avr/boards.txt
micro.menu.bridge0.2=2 (SDA I2C)
micro.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
micro.menu.bridge0.3=3 (SCL I2C)
micro.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
micro.menu.bridge0.4=4
micro.menu.bridge0.4.build.bridge_0=-DBRIDGE_0=4
micro.menu.bridge0.5=5
micro.menu.bridge0.5.build.bridge_0=-DBRIDGE_0=5
micro.menu.bridge0.6=6
micro.menu.bridge0.6.build.bridge_0=-DBRIDGE_0=6
micro.menu.bridge0.7=7
micro.menu.bridge0.7.build.bridge_0=-DBRIDGE_0=7
micro.menu.bridge0.8=8
micro.menu.bridge0.8.build.bridge_0=-DBRIDGE_0=8
micro.menu.bridge0.9=9
micro.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
micro.menu.bridge0.10=10
micro.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
micro.menu.bridge0.11=11
micro.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
micro.menu.bridge0.12=12
micro.menu.bridge0.12.build.bridge_0=-DBRIDGE_0=12
micro.menu.bridge0.13=13
micro.menu.bridge0.13.build.bridge_0=-DBRIDGE_0=13
micro.menu.bridge0.14=MI (MISO SPI)
micro.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
micro.menu.bridge0.15=SCK (SCLK SPI)
micro.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
micro.menu.bridge0.16=MO (MOSI SPI)
micro.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
micro.menu.bridge0.17=SS (SPI)
micro.menu.bridge0.17.build.bridge_0=-DBRIDGE_0=17
micro.menu.bridge0.18=A0
micro.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
micro.menu.bridge0.19=A1
micro.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
micro.menu.bridge0.20=A2
micro.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20
micro.menu.bridge0.21=A3
micro.menu.bridge0.21.build.bridge_0=-DBRIDGE_0=21
micro.menu.bridge0.22=A4
micro.menu.bridge0.22.build.bridge_0=-DBRIDGE_0=22
micro.menu.bridge0.23=A5
micro.menu.bridge0.23.build.bridge_0=-DBRIDGE_0=23

################################
###### Sparkfun Pro Micro ######
################################

promicro.name=Sparkfun Pro Micro

promicro.upload.tool=avrdude
promicro.upload.protocol=avr109
promicro.upload.maximum_size=28672
promicro.upload.maximum_data_size=2560
promicro.upload.speed=57600
promicro.upload.disable_flushing=true
promicro.upload.use_1200bps_touch=true
promicro.upload.wait_for_upload_port=true

promicro.bootloader.tool=avrdude
promicro.bootloader.unlock_bits=0x3F
promicro.bootloader.lock_bits=0x2F
promicro.bootloader.low_fuses=0xFF
promicro.bootloader.high_fuses=0xD8

promicro.build.board=AVR_ATMEGA32U4
promicro.build.core=arduino
promicro.build.variant=promicro
promicro.build.mcu=atmega32u4
promicro.build.usb_product="USB Keyboard"

########## 5V / 16MHz ##########
promicro.menu.cpu.16MHzatmega32U4=5V, 16 MHz

promicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L
promicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
promicro.menu.cpu.16MHzatmega32U4.bootloader.file=Caterina-promicro16.hex

########## 3.3V / 8MHz ##########
promicro.menu.cpu.8MHzatmega32U4=3.3V, 8 MHz

promicro.menu.cpu.8MHzatmega32U4.build.f_cpu=8000000L
promicro.menu.cpu.8MHzatmega32U4.bootloader.extended_fuses=0xFE
promicro.menu.cpu.8MHzatmega32U4.bootloader.file=Caterina-promicro8.hex

########## Keyboard ID ##########
promicro.menu.keyboardid.default=Arduino Leonardo
promicro.menu.keyboardid.default.build.vid=0x2341
promicro.menu.keyboardid.default.build.pid=0x8036

promicro.menu.keyboardid.apple=Apple Aluminium Keyboard
promicro.menu.keyboardid.apple.build.vid=0x05ac
promicro.menu.keyboardid.apple.build.pid=0x0221

promicro.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
promicro.menu.keyboardid.appleint.build.vid=0x05ac
promicro.menu.keyboardid.appleint.build.pid=0x0259

promicro.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
promicro.menu.keyboardid.logitechhid.build.vid=0x046d
promicro.menu.keyboardid.logitechhid.build.pid=0xc316

promicro.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
promicro.menu.keyboardid.logitechgaming.build.vid=0x046d
promicro.menu.keyboardid.logitechgaming.build.pid=0xc335

promicro.menu.keyboardid.ms=Microsoft Keyboard
promicro.menu.keyboardid.ms.build.vid=0x045e
promicro.menu.keyboardid.ms.build.pid=0xfff8

########## Protocol ##########
promicro.menu.protocol.auto=Auto (I2C & Serial)
promicro.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

promicro.menu.protocol.i2c=I2C
promicro.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

promicro.menu.protocol.serial=Serial
promicro.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
promicro.menu.debug.serial=Serial (115200b, newline)
promicro.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

promicro.menu.debug.disabled=Disabled

########## LED ##########
promicro.menu.led.disabled=Disabled

promicro.menu.led.neopixel=Neopixel (WS2812b)
promicro.menu.led.neopixel.build.led_flags=-DENABLE_LED -DNEOPIXEL -DNEOPIXEL_NUM=1

promicro.menu.ledpin.0=RX (Serial)
promicro.menu.ledpin.0.build.led_pin=-DLED_PIN=0
promicro.menu.ledpin.1=TX (Serial)
promicro.menu.ledpin.1.build.led_pin=-DLED_PIN=1
promicro.menu.ledpin.2=2 (SDA I2C)
promicro.menu.ledpin.2.build.led_pin=-DLED_PIN=2
promicro.menu.ledpin.3=3 (SCL I2C)
promicro.menu.ledpin.3.build.led_pin=-DLED_PIN=3
promicro.menu.ledpin.4=4
promicro.menu.ledpin.4.build.led_pin=-DLED_PIN=4
promicro.menu.ledpin.5=5
promicro.menu.ledpin.5.build.led_pin=-DLED_PIN=5
promicro.menu.ledpin.6=6
promicro.menu.ledpin.6.build.led_pin=-DLED_PIN=6
promicro.menu.ledpin.7=7
promicro.menu.ledpin.7.build.led_pin=-DLED_PIN=7
promicro.menu.ledpin.8=8
promicro.menu.ledpin.8.build.led_pin=-DLED_PIN=8
promicro.menu.ledpin.9=9
promicro.menu.ledpin.9.build.led_pin=-DLED_PIN=9
promicro.menu.ledpin.10=10
promicro.menu.ledpin.10.build.led_pin=-DLED_PIN=10
promicro.menu.ledpin.14=14
promicro.menu.ledpin.14.build.led_pin=-DLED_PIN=14
promicro.menu.ledpin.15=15
promicro.menu.ledpin.15.build.led_pin=-DLED_PIN=15
promicro.menu.ledpin.16=16
promicro.menu.ledpin.16.build.led_pin=-DLED_PIN=16
promicro.menu.ledpin.18=A0
promicro.menu.ledpin.18.build.led_pin=-DLED_PIN=18
promicro.menu.ledpin.19=A1
promicro.menu.ledpin.19.build.led_pin=-DLED_PIN=19
promicro.menu.ledpin.20=A2
promicro.menu.ledpin.20.build.led_pin=-DLED_PIN=20
promicro.menu.ledpin.21=A3
promicro.menu.ledpin.21.build.led_pin=-DLED_PIN=21


########## Serial Bridge ##########
promicro.menu.bridge.disabled=Disabled

promicro.menu.bridge.serial1=Serial1
promicro.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

promicro.menu.bridgebutton.2=2 (SDA I2C)
promicro.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
promicro.menu.bridgebutton.3=3 (SCL I2C)
promicro.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
promicro.menu.bridgebutton.4=4
promicro.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
promicro.menu.bridgebutton.5=5
promicro.menu.bridgebutton.5.build.bridge_button=-DBRIDGE_SWITCH=5
promicro.menu.bridgebutton.6=6
promicro.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
promicro.menu.bridgebutton.7=7
promicro.menu.bridgebutton.7.build.bridge_button=-DBRIDGE_SWITCH=7
promicro.menu.bridgebutton.8=8
promicro.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
promicro.menu.bridgebutton.9=9
promicro.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
promicro.menu.bridgebutton.10=10
promicro.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
promicro.menu.bridgebutton.14=14
promicro.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
promicro.menu.bridgebutton.15=15
promicro.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
promicro.menu.bridgebutton.16=16
promicro.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
promicro.menu.bridgebutton.18=A0
promicro.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
promicro.menu.bridgebutton.19=A1
promicro.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
promicro.menu.bridgebutton.20=A2
promicro.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20
promicro.menu.bridgebutton.21=A3
promicro.menu.bridgebutton.21.build.bridge_button=-DBRIDGE_SWITCH=21

